Service - Intermediation/Intermediation.v1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions name="Intermediation" targetNamespace="https://services.ird.govt.nz/GWS/Intermediation/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:tns="https://services.ird.govt.nz/GWS/Intermediation/" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:int="urn:www.ird.govt.nz/GWS:types/Intermediation.v1">
    <wsp:Policy wsu:Id="WSHttpBinding_Intermediation_policy">
        <wsp:ExactlyOne>
            <wsp:All>
                <sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
                    <wsp:Policy>
                        <sp:TransportToken>
                            <wsp:Policy>
                                <sp:HttpsToken RequireClientCertificate="false"/>
                            </wsp:Policy>
                        </sp:TransportToken>
                        <sp:AlgorithmSuite>
                            <wsp:Policy>
                                <sp:Basic256/>
                            </wsp:Policy>
                        </sp:AlgorithmSuite>
                        <sp:Layout>
                            <wsp:Policy>
                                <sp:Strict/>
                            </wsp:Policy>
                        </sp:Layout>
                    </wsp:Policy>
                </sp:TransportBinding>
                <wsam:Addressing>
                    <wsp:Policy>
                        <wsam:AnonymousResponses/>
                    </wsp:Policy>
                </wsam:Addressing>
            </wsp:All>
        </wsp:ExactlyOne>
    </wsp:Policy>
    <wsdl:types>
        <xs:schema elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Intermediation/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
            <xs:element name="RetrieveClientList">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="1" name="RetrieveClientListRequestMsg" nillable="true" type="q1:RetrieveClientListRequestType" xmlns:q1="https://services.ird.govt.nz/GWS/Intermediation/:types/RetrieveClientListRequest"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="RetrieveClientListResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="RetrieveClientListResult" nillable="true" type="q2:RetrieveClientListResponseType" xmlns:q2="https://services.ird.govt.nz/GWS/Intermediation/:types/RetrieveClientListResponse"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
        </xs:schema>
        <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/">
            <xs:element name="anyType" nillable="true" type="xs:anyType"/>
            <xs:element name="anyURI" nillable="true" type="xs:anyURI"/>
            <xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/>
            <xs:element name="boolean" nillable="true" type="xs:boolean"/>
            <xs:element name="byte" nillable="true" type="xs:byte"/>
            <xs:element name="dateTime" nillable="true" type="xs:dateTime"/>
            <xs:element name="decimal" nillable="true" type="xs:decimal"/>
            <xs:element name="double" nillable="true" type="xs:double"/>
            <xs:element name="float" nillable="true" type="xs:float"/>
            <xs:element name="int" nillable="true" type="xs:int"/>
            <xs:element name="long" nillable="true" type="xs:long"/>
            <xs:element name="QName" nillable="true" type="xs:QName"/>
            <xs:element name="short" nillable="true" type="xs:short"/>
            <xs:element name="string" nillable="true" type="xs:string"/>
            <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/>
            <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/>
            <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/>
            <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/>
            <xs:element name="char" nillable="true" type="tns:char"/>
            <xs:simpleType name="char">
                <xs:restriction base="xs:int"/>
            </xs:simpleType>
            <xs:element name="duration" nillable="true" type="tns:duration"/>
            <xs:simpleType name="duration">
                <xs:restriction base="xs:duration">
                    <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/>
                    <xs:minInclusive value="-P10675199DT2H48M5.4775808S"/>
                    <xs:maxInclusive value="P10675199DT2H48M5.4775807S"/>
                </xs:restriction>
            </xs:simpleType>
            <xs:element name="guid" nillable="true" type="tns:guid"/>
            <xs:simpleType name="guid">
                <xs:restriction base="xs:string">
                    <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/>
                </xs:restriction>
            </xs:simpleType>
            <xs:attribute name="FactoryType" type="xs:QName"/>
            <xs:attribute name="Id" type="xs:ID"/>
            <xs:attribute name="Ref" type="xs:IDREF"/>
        </xs:schema>
        <xs:schema elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Intermediation/:types/RetrieveClientListRequest" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://services.ird.govt.nz/GWS/Intermediation/:types/RetrieveClientListRequest">
			<xs:import namespace="urn:www.ird.govt.nz/GWS:types/Intermediation.v1" schemaLocation="Intermediation.v1.xsd"/>
            <xs:complexType name="RetrieveClientListRequestType">
                <xs:sequence>
                    <xs:element name="RetrieveClientListRequestWrapper" nillable="true">
                        <xs:complexType>
                            <xs:sequence>
                                <xs:element ref="int:retrieveClientListRequest"/>
                            </xs:sequence>
                        </xs:complexType>
                    </xs:element>
                </xs:sequence>
            </xs:complexType>
            <xs:element name="RetrieveClientListRequestType" nillable="true" type="tns:RetrieveClientListRequestType"/>
        </xs:schema>
        <xs:schema elementFormDefault="qualified" targetNamespace="https://services.ird.govt.nz/GWS/Intermediation/:types/RetrieveClientListResponse" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="https://services.ird.govt.nz/GWS/Intermediation/:types/RetrieveClientListResponse">
            <xs:import namespace="urn:www.ird.govt.nz/GWS:types/Intermediation.v1" schemaLocation="Intermediation.v1.xsd"/>
            <xs:complexType name="RetrieveClientListResponseType">
                <xs:sequence>
                    <xs:element name="RetrieveClientListResponseWrapper" nillable="true">
                        <xs:complexType>
                            <xs:sequence>
                                <xs:element ref="int:retrieveClientListResponse"/>
                            </xs:sequence>
                        </xs:complexType>
                    </xs:element>
                </xs:sequence>
            </xs:complexType>
            <xs:element name="RetrieveClientListResponseType" nillable="true" type="tns:RetrieveClientListResponseType"/>
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="Intermediation_RetrieveClientList_InputMessage">
        <wsdl:part name="parameters" element="tns:RetrieveClientList"/>
    </wsdl:message>
    <wsdl:message name="Intermediation_RetrieveClientList_OutputMessage">
        <wsdl:part name="parameters" element="tns:RetrieveClientListResponse"/>
    </wsdl:message>
    <wsdl:portType name="Intermediation">
        <wsdl:documentation>The Intermediation service can be utilised for a number of customer tasks. For information regarding the proper use of this service, schemas, formatting of request and response types please refer to the documentation provided during onboarding.</wsdl:documentation>
        <wsdl:operation name="RetrieveClientList">
            <wsdl:documentation>
                <summary>For use of the RetrieveClientList operation please reference the Intermediation namespace, www.ird.govt.nz/Gateway/GWS/Intermediation provided at http://www.ird.govt.nz/software-developers/</summary>
                <returns>RetrieveClientListResponse will have a repeating list of clients and account information. See schema for more details.</returns>
                <param name="RetrieveClientListRequestMsg">RetrieveClientListRequest will contain agency identifying fields in XML format. See Intermediation specific schema for more details.</param>
            </wsdl:documentation>
            <wsdl:input wsam:Action="https://services.ird.govt.nz/GWS/Intermediation/Intermediation/RetrieveClientList" message="tns:Intermediation_RetrieveClientList_InputMessage"/>
            <wsdl:output wsam:Action="https://services.ird.govt.nz/GWS/Intermediation/Intermediation/RetrieveClientListResponse" message="tns:Intermediation_RetrieveClientList_OutputMessage"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="WSHttpBinding_Intermediation" type="tns:Intermediation">
        <wsp:PolicyReference URI="#WSHttpBinding_Intermediation_policy"/>
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="RetrieveClientList">
            <soap12:operation soapAction="https://services.ird.govt.nz/GWS/Intermediation/Intermediation/RetrieveClientList" style="document"/>
            <wsdl:input>
                <soap12:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="Intermediation">
        <wsdl:port name="WSHttpBinding_Intermediation" binding="tns:WSHttpBinding_Intermediation">
            <soap12:address location="https://eservices-test-gateway.npnsp.ird.govt.nz:4046/Gateway/GWS/Intermediation/"/>
            <wsa10:EndpointReference>
                <wsa10:Address>https://eservices-test-gateway.npnsp.ird.govt.nz:4046/Gateway/GWS/Intermediation/</wsa10:Address>
            </wsa10:EndpointReference>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>