Intermediation/sample messages/RetriveClientList-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
   xmlns:a="https://www.w3.org/2005/08/addressing">
   <soap:Header>
      <a:Action>https://services.ird.govt.nz/GWS/Intermediation/Intermediation/RetrieveClientList</a:Action>
   </soap:Header>
   <soap:Body>
      <int:RetrieveClientList xmlns:int="https://services.ird.govt.nz/GWS/Intermediation/" 
         xmlns:ret="https://services.ird.govt.nz/GWS/Intermediation/:types/RetrieveClientListRequest" 
         xmlns:int1="urn:www.ird.govt.nz/GWS:types/Intermediation.v1" 
         xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
         <int:RetrieveClientListRequestMsg>
            <ret:RetrieveClientListRequestWrapper>
               <int1:retrieveClientListRequest>
                  <cmn:softwareProviderData>
                     <cmn:softwareProvider>Software Provider</cmn:softwareProvider>
                     <cmn:softwarePlatform>Software_Platform</cmn:softwarePlatform>
                     <cmn:softwareRelease>1.0</cmn:softwareRelease>
                  </cmn:softwareProviderData>
                  <cmn:identifier IdentifierValueType="IRD">132261132</cmn:identifier>
                  <int1:filterAccountType>EMP</int1:filterAccountType>
                  <int1:filterClientListID>132280722</int1:filterClientListID>
               </int1:retrieveClientListRequest>
            </ret:RetrieveClientListRequestWrapper>
         </int:RetrieveClientListRequestMsg>
      </int:RetrieveClientList>
   </soap:Body>
</soap:Envelope>